Revit 2027 API
BuiltInFailures.LooseDimensionFailures.LooseFaceSplitsForCurtainWall Property
 Switching element type to Curtain Family. All Split Face Regions in the element will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LooseFaceSplitsForCurtainWall { get; }
Public Shared ReadOnly Property LooseFaceSplitsForCurtainWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LooseFaceSplitsForCurtainWall {
	FailureDefinitionId^ get ();
}
static member LooseFaceSplitsForCurtainWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LooseDimensionFailures Class
Autodesk.Revit.DB Namespace